In [42]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [43]:
names=['Sara','Noura','Dana']
s1= pd.Series(names)
s1.index=[1,2,3]
s1

1     Sara
2    Noura
3     Dana
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [44]:
s1.index=[11, 12, 13 ]
s1

11     Sara
12    Noura
13     Dana
dtype: object

## Q3: Retrieve First and second elements.

In [45]:
s1[0:2]

11     Sara
12    Noura
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [46]:
x= pd.Series(['Dana','Lama'])
s1= s1.append(x)
s1

11     Sara
12    Noura
13     Dana
0      Dana
1      Lama
dtype: object

In [47]:
s1.drop_duplicates()

11     Sara
12    Noura
13     Dana
1      Lama
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [48]:
s2= {'ID':[101,102,103,104], 'Name':['Sara','Noura', 'Dana', 'Lama']}
student = pd.DataFrame(s2, columns=['ID','Name'])
student

    ID   Name
0  101   Sara
1  102  Noura
2  103   Dana
3  104   Lama

## Q6: Read educ_figdp_1_Data.csv file

In [49]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [50]:
edu.loc[90:94, ['TIME', 'GEO']]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [51]:
edu[10:14]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s